{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": [20, 40, 3], "arguments": {}, "batch_input_shape": [null, 20, 40, 3], "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faM/home/behrooz/robotic/Udacity_SDCND/Behavioral_Cloning/behaviorial_cloning.py\u00da\b<lambda>\u00d6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_28", "input_dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_92"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_15"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_93"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_16"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "nb_col": 1, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_94"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_17"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 1, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_95"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 192, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 50, "W_constraint": null, "name": "dense_10"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_18"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_11", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 10, "W_constraint": null, "name": "dense_11"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_19"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_12", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_12"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_20"}}], "keras_version": "1.2.0"}