{"config": [{"config": {"output_shape_type": "raw", "output_shape": [20, 40, 3], "function_type": "lambda", "trainable": true, "batch_input_shape": [null, 20, 40, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0016behaviorial_cloning.py\u00da\b<lambda>\u008c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_1", "nb_row": 3, "trainable": true, "W_regularizer": null, "border_mode": "valid", "activation": "elu", "b_constraint": null, "W_constraint": null, "nb_filter": 8, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "bias": true, "dim_ordering": "tf", "name": "convolution2d_2", "nb_row": 3, "trainable": true, "W_regularizer": null, "border_mode": "valid", "activation": "elu", "b_constraint": null, "W_constraint": null, "nb_filter": 8, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 1, "bias": true, "dim_ordering": "tf", "name": "convolution2d_3", "nb_row": 1, "trainable": true, "W_regularizer": null, "border_mode": "valid", "activation": "elu", "b_constraint": null, "W_constraint": null, "nb_filter": 16, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "output_dim": 50, "activity_regularizer": null, "activation": "elu", "b_constraint": null, "input_dim": 64, "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "output_dim": 10, "activity_regularizer": null, "activation": "elu", "b_constraint": null, "input_dim": 50, "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_3", "output_dim": 1, "activity_regularizer": null, "activation": "tanh", "b_constraint": null, "input_dim": 10, "trainable": true, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}