{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": [20, 40, 3], "arguments": {}, "batch_input_shape": [null, 20, 40, 3], "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa <ipython-input-114-6e27a84e39cf>\u00da\b<lambda>\u000f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_35", "input_dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 6, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_120"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_36"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 9, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_121"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_37"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 12, "nb_col": 1, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_122"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_38"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 16, "nb_col": 1, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_123"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_31", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_11"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 48, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 50, "W_constraint": null, "name": "dense_31"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_39"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_32", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 10, "W_constraint": null, "name": "dense_32"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_40"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_33", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_33"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_41"}}], "keras_version": "1.2.0"}