{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 14, 40, 3], "output_shape": [14, 40, 3], "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa?/home/behrooz/robotic/Udacity_SDCND/Behavioral_Cloning/model.py\u00da\b<lambda>\u0093\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_col": 1, "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "activation": "elu", "nb_filter": 8, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_col": 1, "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "name": "convolution2d_2", "activation": "elu", "nb_filter": 8, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "nb_col": 1, "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "dim_ordering": "tf", "init": "glorot_uniform", "trainable": true, "name": "convolution2d_3", "activation": "elu", "nb_filter": 8, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "output_dim": 1, "b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": 40, "name": "dense_1", "activation": "tanh", "W_regularizer": null}}], "keras_version": "1.2.0"}