{"config": [{"config": {"nb_col": 5, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "nb_row": 5, "batch_input_shape": [null, 80, 160, 3], "nb_filter": 2, "init": "glorot_uniform", "input_dtype": "float32", "activity_regularizer": null, "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_col": 5, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "nb_row": 5, "nb_filter": 2, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "input_dim": 1258, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_5", "input_dim": 50, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_6", "input_dim": 10, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}