{"config": [{"config": {"nb_col": 5, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "nb_row": 5, "batch_input_shape": [null, 80, 160, 3], "nb_filter": 10, "init": "glorot_uniform", "input_dtype": "float32", "activity_regularizer": null, "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_col": 5, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_6", "b_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "nb_row": 5, "nb_filter": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_7", "input_dim": 6290, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_8", "input_dim": 50, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_9", "input_dim": 10, "b_constraint": null, "trainable": true, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}