{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "input_dtype": "float32", "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 6, "name": "convolution2d_1", "nb_col": 5, "W_constraint": null, "border_mode": "valid", "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 6, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "nb_row": 5, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "name": "convolution2d_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 50, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_1", "input_dim": 3774, "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_2", "input_dim": 50, "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_3", "input_dim": 10, "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}]}