{"config": [{"config": {"output_shape_type": "raw", "name": "lambda_2", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-d5b6f20a8d95>\u00da\b<lambda>a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 20, 40, 3], "arguments": {}, "trainable": true, "output_shape": [20, 40, 3], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_4", "init": "glorot_uniform", "trainable": true, "nb_filter": 8, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_5", "init": "glorot_uniform", "trainable": true, "nb_filter": 8, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_5", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_6", "init": "glorot_uniform", "trainable": true, "nb_filter": 16, "nb_row": 1, "nb_col": 1, "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_6", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_4", "input_dim": 64, "init": "glorot_uniform", "output_dim": 50, "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_5", "input_dim": 50, "init": "glorot_uniform", "output_dim": 10, "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "activation": "elu", "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_6", "input_dim": 10, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "W_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "activation": "tanh", "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}