{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": [20, 40, 3], "arguments": {}, "batch_input_shape": [null, 20, 40, 3], "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faM/home/behrooz/robotic/Udacity_SDCND/Behavioral_Cloning/behaviorial_cloning.py\u00da\b<lambda>\u00d6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_58", "input_dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 8, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_194"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_105"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 8, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_195"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_106"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 16, "nb_col": 1, "trainable": true, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_row": 1, "activity_regularizer": null, "bias": true, "activation": "elu", "b_constraint": null, "W_constraint": null, "name": "convolution2d_196"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_107"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_29"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 64, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 50, "W_constraint": null, "name": "dense_79"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_87"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_66", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 10, "W_constraint": null, "name": "dense_80"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_88"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_67", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_81"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_89"}}], "keras_version": "1.2.0"}