{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 80, 160, 3], "subsample": [2, 2], "input_dtype": "float32", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 6, "W_constraint": null, "W_regularizer": null, "nb_row": 5, "border_mode": "valid", "activation": "linear", "name": "convolution2d_31", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_76"}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "border_mode": "valid", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "nb_filter": 6, "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "linear", "name": "convolution2d_32", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_77"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_16"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "trainable": true, "input_dim": 3774, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_constraint": null, "name": "dense_46"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_78"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_31", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "input_dim": 50, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_constraint": null, "name": "dense_47"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_79"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_32", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "input_dim": 10, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_constraint": null, "name": "dense_48"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_80"}, "class_name": "Activation"}], "class_name": "Sequential"}