{"config": [{"config": {"output_shape": [14, 40, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00d5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "batch_input_shape": [null, 14, 40, 3], "arguments": {}, "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "nb_filter": 8, "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "nb_col": 1, "subsample": [1, 1], "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "nb_filter": 8, "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "nb_col": 1, "subsample": [1, 1], "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "nb_row": 1, "nb_filter": 8, "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "nb_col": 1, "subsample": [1, 1], "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "input_dim": 40, "output_dim": 1, "activation": "tanh"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}