{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0091\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape": [14, 40, 3], "trainable": true, "batch_input_shape": [null, 14, 40, 3], "function_type": "lambda", "input_dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 8, "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "elu", "subsample": [1, 1], "trainable": true, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 8, "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "elu", "subsample": [1, 1], "trainable": true, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "nb_row": 1, "nb_col": 1, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "elu", "subsample": [1, 1], "trainable": true, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "b_constraint": null, "trainable": true, "output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 64, "activity_regularizer": null, "bias": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "b_constraint": null, "trainable": true, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "bias": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_3", "b_constraint": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "bias": true, "activation": "tanh"}}]}